{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "LlavaForConditionalGeneration",
    "parent_library": "transformers.models.llava.modeling_llava"
  },
  "base_model_name_or_path": "ahmed-masry/ChartInstruct-LLama2",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": "gaussian",
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 8,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "q_proj",
    "up_proj",
    "reduction",
    "value",
    "down_proj",
    "key",
    "gate_proj",
    "v_proj",
    "k_proj",
    "dense",
    "o_proj",
    "query"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}